---
layout: single
title: 'Win32 reverse shellcode - pt .2 - locating the Export Directory Table'
description: 'This blog post shows how to locate the Export Directory Table from the PE file structure '
date: 2021-07-20
classes: wide
comments: false
header:
  teaser: /assets/images/avatar.jpg
tags:
  - WinDbg
  - Win32 assembly
  - Exploit Development
  - Windows API
  - PE file structure
  - Export Directory Table 
--- 

<p align="justify">
This article focuses on how to locate the Export Directory Table from the PE file structure. This is the second part of a blog series that focuses on how to create a custom Win32 reverse shellcode. 
<br><br>
The first part can be found at the following link 
</p>

* [Win32 reverse shellcode - pt .1 - Locating the kernelbase.dll base address](https://xen0vas.github.io/Win32-Reverse-Shell-Shellcode-part-1-Locating-the-kernelbase-address)

<p align="justify">
According to Microsoft Docs, 
<br>

<blockquote class="">
<p align="justify">
<i>The export symbol information begins with the export directory table, which describes the remainder of the export symbol information. The export directory table contains address information that is used to resolve imports to the entry points within this image. Following, the export address table contains the address of exported entry points and exported data and absolutes. An ordinal number is used as an index into the export address table. If the address specified is not within the export section (as defined by the address and length that are indicated in the optional header), the field is an export RVA, which is an actual address in code or data. Otherwise, the field is a forwarder RVA, which names a symbol in another DLL.</i>
</p>
</blockquote>
</p>

<hr>
<b><span style="color:green;font-size:26px">Search for the Export Directory Table</span></b>

<p align="justify">
From the previous post <a href="https://xen0vas.github.io/Win32-Reverse-Shell-Shellcode-part-1-Locating-the-kernelbase-address/">[pt .1]</a>, we have accomplished to locate the <code  style="background-color: lightgrey; color:black;"><b>kernelbase.dll</b></code> base address. Now that we have the <code  style="background-color: lightgrey; color:black;"><b>kernelbase.dll</b></code> address, we need to parse the PE file structure to find the offset of the export directory table. It is worth to mention here that we will not proceed further in details about the PE file structure, but the following screenshot can provide useful information about the format of the PE file structure.
</p>

<img style="display: block;margin-left: auto;margin-right: auto;border: 1px solid red;" src="https://xen0vas.github.io/assets/images/2021/07/pe.png" alt="PE File Structure Format"/>

<p align="justify">
The image above has been taken from the following blog post which explains the PE format in more detail. 
</p>

* [PE File Format](https://dandylife.net/blog/archives/388)

<p align="justify">
Before moving further, we need to locate the exact offset of the <code  style="background-color: lightgrey; color:black;"><b>e_lfanew</b></code>. The <code  style="background-color: lightgrey; color:black;"><b>e_lfanew</b></code> field is a 4-byte offset into the file where the PE file header is located. It is necessary to use this offset to locate the PE header in the file. In WinDbg we run the <code  style="background-color: lightgrey; color:black;">dt -n _IMAGE_DOS_HEADER</code> as follows
</p>


<pre style="color: white;background: #000000;border: 1px solid #ddd;border-left: 3px solid #f36d33;page-break-inside: avoid;font-family: Courier New;font-size: 14px;line-height: 1.6;margin-bottom: 1.6em;max-width: 100%;padding: 1em 1.5em;display: block;white-space: pre-wrap;white-space: -moz-pre-wrap;white-space: -pre-wrap;white-space: -o-pre-wrap;word-wrap: break-word;">
0:000> dt -n _IMAGE_DOS_HEADER
ntdll!_IMAGE_DOS_HEADER
   +0x000 e_magic          : Uint2B
   +0x002 e_cblp           : Uint2B
   +0x004 e_cp             : Uint2B
   +0x006 e_crlc           : Uint2B
   +0x008 e_cparhdr        : Uint2B
   +0x00a e_minalloc       : Uint2B
   +0x00c e_maxalloc       : Uint2B
   +0x00e e_ss             : Uint2B
   +0x010 e_sp             : Uint2B
   +0x012 e_csum           : Uint2B
   +0x014 e_ip             : Uint2B
   +0x016 e_cs             : Uint2B
   +0x018 e_lfarlc         : Uint2B
   +0x01a e_ovno           : Uint2B
   +0x01c e_res            : [4] Uint2B
   +0x024 e_oemid          : Uint2B
   +0x026 e_oeminfo        : Uint2B
   +0x028 e_res2           : [10] Uint2B
   <span style="color:#cd0000;"><b>+0x03c e_lfanew         : Int4B</b></span>
</pre>

<p align="justify">
As we see above, the <code  style="background-color: lightgrey; color:black;"><b>e_lfanew</b></code> exists at offset <code  style="background-color: lightgrey; color:black;"><b>0x03c</b></code>. According to <a href="https://blog.kowalczyk.info/articles/pefileformat.html">[ this ]</a> blog ,the MS-DOS header occupies the first 64 bytes of the PE file. A structure representing its content is described below
</p>

<pre style="color: white;background: #000000;border: 1px solid #ddd;border-left: 3px solid #f36d33;page-break-inside: avoid;font-family: Courier New;font-size: 14px;line-height: 1.6;margin-bottom: 1.6em;max-width: 100%;padding: 1em 1.5em;display: block;white-space: pre-wrap;white-space: -moz-pre-wrap;white-space: -pre-wrap;white-space: -o-pre-wrap;word-wrap: break-word;">
typedef struct _IMAGE_DOS_HEADER { 
